asm-jaime/aci_vector_control_F28035_DRV8301/clang_modules/support_F2803x/F2803x_headers/f2803xbmsk.h
#define DISABLE_TZ1_CBC             0x0000
#define ENABLE_TZ1_CBC              0x0001

#define DISABLE_TZ2_CBC             0x0000
#define ENABLE_TZ2_CBC              0x0002

#define DISABLE_TZ3_CBC             0x0000
#define ENABLE_TZ3_CBC              0x0004

#define DISABLE_TZ4_CBC             0x0000
#define ENABLE_TZ4_CBC              0x0008

#define DISABLE_TZ5_CBC             0x0000
#define ENABLE_TZ5_CBC              0x0010

#define DISABLE_TZ6_CBC             0x0000
#define ENABLE_TZ6_CBC              0x0020

#define DISABLE_DCAEVT2_CBC         0x0000
#define ENABLE_DCAEVT2_CBC          0x0040

#define DISABLE_DCBEVT2_CBC         0x0000
#define ENABLE_DCBEVT2_CBC          0x0080

#define DISABLE_TZ1_OST             0x0000
#define ENABLE_TZ1_OST              0x0100

#define DISABLE_TZ2_OST             0x0000
#define ENABLE_TZ2_OST              0x0200

#define DISABLE_TZ3_OST             0x0000
#define ENABLE_TZ3_OST              0x0400

#define DISABLE_TZ4_OST             0x0000
#define ENABLE_TZ4_OST              0x0800

#define DISABLE_TZ5_OST             0x0000
#define ENABLE_TZ5_OST              0x1000

#define DISABLE_TZ6_OST             0x0000
#define ENABLE_TZ6_OST              0x2000

#define DISABLE_DCAEVT1_OST         0x0000
#define ENABLE_DCAEVT1_OST          0x4000

#define DISABLE_DCBEVT1_OST         0x0000
#define ENABLE_DCBEVT1_OST          0x8000

/*------------------------------------------------------------------------------
 F280X Trip Zone Control Register (TZCTL)
------------------------------------------------------------------------------*/
#define TZA_HI_Z                    0x0000
#define TZA_FORCE_HI                0x0001
#define TZA_FORCE_LO                0x0002
#define TZA_NOTHING                 0x0003

#define TZB_HI_Z                    0x0000
#define TZB_FORCE_HI                0x0004
#define TZB_FORCE_LO                0x0008
#define TZB_NOTHING                 0x000C

#define DCAEVT1_HI_Z                0x0000
#define DCAEVT1_FORCE_HI            0x0010
#define DCAEVT1_FORCE_LO            0x0020
#define DCAEVT1_NOTHING             0x0030

#define DCAEVT2_HI_Z                0x0000
#define DCAEVT2_FORCE_HI            0x0040
#define DCAEVT2_FORCE_LO            0x0080
#define DCAEVT2_NOTHING             0x00C0

#define DCBEVT1_HI_Z                0x0000
#define DCBEVT1_FORCE_HI            0x0100
#define DCBEVT1_FORCE_LO            0x0200
#define DCBEVT1_NOTHING             0x0300

#define DCBEVT2_HI_Z                0x0000
#define DCBEVT2_FORCE_HI            0x0400
#define DCBEVT2_FORCE_LO            0x0800
#define DCBEVT2_NOTHING             0x0C00

/*------------------------------------------------------------------------------
 F280X Trip Enable Interrupt Register (TZEINT)
------------------------------------------------------------------------------*/
#define DISABLE_CBC_INT            0x0000
#define ENABLE_CBC_INT             0x0002

#define DISABLE_OST_INT            0x0000
#define ENABLE_OST_INT             0x0004

#define DISABLE_DCAEVT1_INT        0x0000
#define ENABLE_DCAEVT1_INT         0x0008

#define DISABLE_DCAEVT2_INT        0x0000
#define ENABLE_DCAEVT2_INT         0x0010

#define DISABLE_DCBEVT1_INT        0x0000
#define ENABLE_DCBEVT1_INT         0x0020

#define DISABLE_DCBEVT2_INT        0x0000
#define ENABLE_DCBEVT2_INT         0x0040

/*------------------------------------------------------------------------------
 F280X Event Trigger Selection Register (ETSEL)
------------------------------------------------------------------------------*/
#define INTSEL_CNT_ZERO            0x0001
#define INTSEL_PRD_EQ              0x0002
#define INTSEL_CMPA_EQ_UC          0x0004
#define INTSEL_CMPA_EQ_DC          0x0005
#define INTSEL_CMPB_EQ_UC          0x0006
#define INTSEL_CMPB_EQ_DC          0x0007

#define INTSEL_DISABLE             0x0000
#define INTSEL_ENABLE              0x0008

#define SOCASEL_CNT_ZERO           0x0100
#define SOCASEL_PRD_EQ             0x0200
#define SOCASEL_CMPA_EQ_UC         0x0400
#define SOCASEL_CMPA_EQ_DC         0x0500
#define SOCASEL_CMPB_EQ_UC         0x0600
#define SOCASEL_CMPB_EQ_DC         0x0700

#define SOCASEL_DISABLE            0x0000
#define SOCASEL_ENABLE             0x0800

#define SOCBSEL_CNT_ZERO           0x1000
#define SOCBSEL_PRD_EQ             0x2000
#define SOCBSEL_CMPA_EQ_UC         0x4000
#define SOCBSEL_CMPA_EQ_DC         0x5000
#define SOCBSEL_CMPB_EQ_UC         0x6000
#define SOCBSEL_CMPB_EQ_DC         0x7000

#define SOCBSEL_DISABLE            0x0000
#define SOCBSEL_ENABLE             0x8000

/*------------------------------------------------------------------------------
 F280X Event Trigger Pre-Scale Register (ETPS)
------------------------------------------------------------------------------*/
#define INTPRD_DISABLE             0x0000
#define INTPRD_ONE_EVENT           0x0001
#define INTPRD_TWO_EVENT           0x0002
#define INTPRD_THREE_EVENT         0x0003

#define SOCAPRD_DISABLE            0x0000
#define SOCAPRD_ONE_EVENT          0x0100
#define SOCAPRD_TWO_EVENT          0x0200
#define SOCAPRD_THREE_EVENT        0x0300

#define SOCBPRD_DISABLE            0x0000
#define SOCBPRD_ONE_EVENT          0x1000
#define SOCBPRD_TWO_EVENT          0x2000
#define SOCBPRD_THREE_EVENT        0x3000

/*------------------------------------------------------------------------------
 F280X ECAP Control Register 1 (ECCTL1)
------------------------------------------------------------------------------*/
#define CAP1POL_RISING_EDGE        0x0000
#define CAP1POL_FALLING_EDGE       0x0001

#define CTRRST1_ABSOLUTE_TS        0x0000
#define CTRRST1_DIFFERENCE_TS      0x0002

#define CAP2POL_RISING_EDGE        0x0000
#define CAP2POL_FALLING_EDGE       0x0004

#define CTRRST2_ABSOLUTE_TS        0x0000
#define CTRRST2_DIFFERENCE_TS      0x0008

#define CAP3POL_RISING_EDGE        0x0000
#define CAP3POL_FALLING_EDGE       0x0010

